IDEA Open Model
MaterialBoltGrade.MprlElementID Property
Compatible with IDEA StatiCa v 10.1
 Name fo the bolt grade in MPRL database
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public Guid MprlElementID { get; set; }
Public Property MprlElementID As Guid
	Get
	Set
public:
property Guid MprlElementID {
	Guid get ();
	void set (Guid value);
}
Property Value
Type: Guid
See Also
Reference
MaterialBoltGrade Class
IdeaRS.OpenModel.Material Namespace